saved some screenshots and craeted some diagrams
